Revit 2026 API

# CompoundStructureSampleHeight Property

---

The sample height is the presumed height of the wall to which the data in this CompoundStructure is applied.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SampleHeight { get; set; }
```
```vb
Public Property SampleHeight As Double
	Get
	Set
```
```cpp
public:
property double SampleHeight {
	double get ();
	void set (double value);
}
```
```fsharp
member SampleHeight : float with get, set
```

#### Property Value

Double The height of the wall used to define the vertically compound structure.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value newSampleHeight is smaller than the value of MinimumSampleHeight. |
| InvalidOperationException | This operation is valid only for vertically compound structures. |

This value has meaning only for vertically compound structures. In order to apply this CompoundStructure to a wall whose height differs from the sample height, the underlying grid will be rescaled.

#### Reference

CompoundStructure Class

Autodesk.Revit.DB Namespace